import { createStyles, makeStyles, Theme } from "@material-ui/core/styles";
import Container from "@material-ui/core/Container";

const useStyles = makeStyles((theme: Theme) =>
  createStyles({
    container: {
      marginTop: theme.spacing(2),
    },
    table: {
      minWidth: 650,
    },
    tableSpace: {
      marginTop: 20,
    },
  })
);

function Home() {
  const classes = useStyles();

  return (
    <div>
      <Container className={classes.container} maxWidth="md">
        <h1 style={{ textAlign: "center" }}>ระบบการส่งต่อผู้ป่วยเกินศักยภาพ</h1>
        <h4>Requirements</h4>
        <p>
        ระบบประวัติผู้ป่วยของโรงพยาบาลเป็นระบบที่บุคลากรทางการแพทย์สามารถเข้าสู่ระบบเพื่อให้บุคลากร
        ทางการแพทย์สามารถเข้าถึงข้อมูลประวัติของผู้ป่วยหรือหากยังไม่มีข้อมูลในระบบก็สามารถบันทึกข้อมูลเพิ่มได้ 
        โดยเริ่มที่เจ้าหน้าที่เวชระเบียนจะทำการลงทะเบียนผู้ป่วยหากยังไม่เคยเข้ารับการรักษาที่นี่มาก่อน จากนั้นจะนำ
        ข้อมูลผู้ป่วยส่งให้แผนกต่าง ๆ เพื่อนำไปประกอบการวินิจฉัยโรคและทำการรักษาได้และหากอาการของผู้ป่วยนั้น
        เกินกว่าศักยภาพของโรงพยาบาลจะรักษาได้จะใช้ระบบการส่งต่อผู้ป่วยเกินศักยภาพ โดยระบบย่อยนี้แพทย์
        เจ้าของไข้จะเป็นผู้ทำการบันทึกข้อมูลที่จำเป็นสำหรับการส่งต่อผู้ป่วยเกินศักยภาพ เช่น ประวัติผู้ป่วย โรค 
        โรงพยาบาลที่รับ สาเหตุที่จำเป็นต้องส่งต่อ เป็นต้น ลงในแบบบันทึกการส่งต่อเพื่อใช้ข้อมูลในแบบบันทึกการส่งต่อ
        ที่ได้ในการติดต่อประสานงานกับโรงพยาบาลที่รับส่งต่อ
        </p>
      </Container>
    </div>
  );
}
export default Home;